Repository: itx-informationssysteme/jobapplications
Catalog: Resources/Private/Language/*.locallang_backend.xlf
Languages: de

# tx_jobapplications_domain_model_posting.date_of_application
source: Date of Application
de: Eingangsdatum

# mlang_tabs_tab
source: Applications
de: Bewerbungen

# tx_jobapplications_frontend.description
source: Plugins, enabling you to list and show job postings and letting people apply.
de: Möglichkeit Stellenanzeigen darzustellen, sowie ein Bewerbungsformular für diese einzurichten.

# flexform.showSalarayExpectation
source: Show "Salary Expectation" Field
de: Zeige "Gehaltsvorstellung" Feld

# flexform.showEarliestDateOfJoining
source: Show "Earliest Date Of Joining" Field
de: Zeige "Frühstmögliches Eintrittsdatum" Feld

# flexform.general.detailView
source: Set Detail Page Uid
de: Detailansicht-Seite Uid

# flexform.general.applicationForm
source: Set Application Form Page Uid
de: Bewerbungsformular-Seite Uid

# flexform.successPage
source: Success Page Specification
de: Erfolgsseite (nach Abschicken der Bewerbung)

# flexform.tab.postingTitle
source: Postings Settings
de: Stellenanzeigen Einstellungen

# flexform.sendEmailToInternal
source: Should new applications be sent to a specific E-Mail address?
de: Sollen neue Bewerbungen an eine spezifische E-Mail Adresse gesendet werden?

# flexform.saveApplicationInBackend
source: Should Applications be saved in the backend?
de: Sollen Bewerbungen im Backend gespeichert werden?

# flexform.sendEmailToContact
source: Should the referenced contact receive an E-Mail?
de: Soll der in der Ausschreibung referenzierte Kontakt eine E-Mail erhalten?

# flexform.sendEmailToApplicantText
source: E-Mail to Applicant Text
de: Text für E-Mail an Bewerber

# flexform.linkPrivacy
source: Link Privacy Agreement Page
de: Link zur Datenschutzerklärung

# flexform.sendEmailToApplicantSubject
source: E-Mail to Applicant Subject (Templating available: Posting Title: %postingTitle%)
de: Betreff für E-Mail an Bewerber

# flexform.emailSenderName
source: E-Mail Sender Name
de: Absender Name für E-Mails

# flexform.emailSender
source: E-Mail Sender E-Mail
de: Absender E-Mail für E-Mails

# flexform.sendEmailToApplicant
source: Should an E-Mail be sent to the applicant?
de: Soll eine E-Mail an den Bewerber gesendet werden?

# flexform.applicationsEnabled
source: Application Module
de: Bewerbungsmodul

# flexform.showContact
source: Show Contact?
de: Zeige Kontakt?

# flexform.category
source: [Optional] Show only postings of:
de: [Optional] Zeige nur Ausschreibungen von:

# flexform.googleMapsApiKey
source: Enter a Google Maps API Key here to enable contact info maps support
de: Google Maps API Key

# flexform.showLocationTitle
source: Show title of location?
de: Soll der Titel des Standorts angezeigt werden?

# flexform.showContactPhoto
source: Show contact photo?
de: Soll das Foto des Kontakts angezeigt werden?

# flexform.pageTitle
source: Define page title here (%postingTitle% gets replaced with title of posting)
de: Seitentitel

# flexform.messageMaxLength
source: Maximum message number of characters:
de: Maximale Anzahl an Zeichen in Nachricht Feld:

# flexform.itemsOnPage
source: Number of postings per page:
de: Anzahl Stellenausschreibungen pro Seite:

# flexform.showMessage
source: Show message field?
de: Zeige Nachricht-Feld?

# flexform.successMessage
source: Enter the message that will be shown to the applicant after submitting the application
de: Die Nachricht für den Bewerber, nachdem dieser die Bewerbung abgeschickt hat

# flexform.selectedContacts
source: Select contact to display in frontend
de: Kontakt auswählen, welcher dann im Frondend angezeigt wird

# flexform.header
source: [Optional] Header to be shown as section header
de: [Optional] Überschrift der Sektion, welche dieses Plugin darstellt

# be.listApplications.showButton
source: Show
de: Anzeigen

# be.listApplications.filter.noApps
source: There are no applications matching your selection
de: Es gibt keine Bewerbungen, welche auf Ihre Auswahl zutreffen.

# be.filter.contacts
source: Contact
de: Kontakt

# be.filter.postings
source: Posting
de: Stellenausschreibung

# be.showApp.address
source: Address
de: Adresse

# be.show.privacy_agreement.yes
source: Accepted
de: Akzeptiert

# be.show.privacy_agreement.no
source: Not accepted
de: Nicht akzeptiert

# be.filter.archived
source: Archived
de: Archiviert

# be.show.archive
source: Archive
de: Archivieren

# be.show.dearchive
source: De-Archive
de: Wiederherstellen

# be.show.delete
source: Delete Application
de: Bewerbung löschen

# conf.companyName
source: Company Name: Used for google jobs structured data
de: Unternehmensname: Wird für Goolge Jobs benutzt

# conf.logo
source: [Optional] Logo: Logo as public link
de: [Optional] Logo: Logo als öffentlicher Link

# conf.currency
source: Currency: Used for Google Jobs. In ISO 4217 format!
de: Währung: Wird für Google Jobs benutzt. Im ISO 4217 Format!

# conf.customFileSizeLimit
source: Override the automatically fetched server upload file size limit. (in kilobytes)
de: Überschreiben des automatischen Server-Datei-Upload-Limits mit einem eigenen Wert. (in Kilobytes)

# be.dashboard.welcome
source: Welcome back %s %s!
de: Willkommen zurück, %s %s!

# be.dashboard.unread.multiple
source: You have %s new applications.
de: Sie haben %s neue Bewerbungen.

# be.dashboard.unread.one
source: You have %s new application.
de: Sie haben %s neue Bewerbung.

# be.dashboard.applicationAdmin
source: Application Administration
de: Verwaltung Bewerbungen

# be.dashboard.settings
source: Settings
de: Einstellungen

# be.show.title
source: Applicant Overview
de: Übersicht Bewerber

# be.dashboard.title
source: Dashboard
de: Übersicht

# be.settings.generateStatusDe
source: Generate status elements in german
de: Generiere Statuselemente auf deutsch

# be.settings.generateStatusEn
source: Generate status elements in english
de: Generiere Statuselemente in englisch

# task.days.label
source: How many days old?
de: Wie alt (in Tagen) muss die Bewerbung sein?

# task.days.empty
source: Days can't be empty!
de: Feld Tage darf nicht leer sein!

# task.status.label
source: Should the status be considered? (End state)
de: Soll der Status berücksichtigt werden? (s. Endstatus)

# CleanUpApplications.title
source: Clean up old applications
de: Löschen alter Bewerbungen

# CleanUpApplications.description
source: This task deletes all applications which are equal or older than the given days.
de: Dieser Plan löscht alle alten Bewerbungen, wobei das Alter in Tagen spezifiziert wird.

# AnonymizeApplications.title
source: Anonymize old applications
de: Anonymisieren alter Bewerbungen

# AnonymizeApplications.description
source: This task anonymizes all applications which are equal or older than the given days.
de: Dieser Plan anonymisiert alle alten Bewerbungen, wobei das Alter in Tagen spezifiziert wird.

# tx_jobapplications_contactdisplay.title
source: Jobapplications: Contact Display
de: Jobapplications: Kontakte Anzeige

# tx_jobapplications_applicationform.title
source: Jobapplications: Application Form
de: Jobapplications: Bewerbungsformular

# tx_jobapplications_detailview.title
source: Jobapplications: Detail View
de: Jobapplications: Detailansicht

# tx_jobapplications_frontend.title
source: Jobapplications: Postings
de: Jobapplications: Ausschreibungen

# tx_jobapplications_successpage.title
source: Jobapplications: Application Success Page
de: Jobapplications: Bewerbung erfolgreich versendet

# legacy_upload
source: Use 4 predefined upload fields (4 Fields Cover Letter, CV, Testimonials, Other) instead of a single mutli file upload
de: 4 Datei-Upload-Felder (Anschreiben, Lebenslauf, Zeugnisse, Anderes) anstelle eines einzigen mehrfach-Upload Feldes benutzen

# be.settings.batchIndex
source: This option allows you to regenerate batch indexing requests for Google Jobs. It iterates over each Posting and sends an request for each of them. That means it could take a while. You will be notified when the process has findished. Beware each request consumes a up your Google request contigent (standard is 200), so use this feature economically.
de: Hier lässt sich eine Batch Indizierung für Google Jobs anstoßen. Der Prozess iteriert über alle Postings und schickt jeweils eine Request an Google. Das bedeutet möglicherweise, dass diese Funktion einige Google Kontingent Einheiten verbraucht. Es ist also ratsam diese Funktion sparsam zu verwenden.

# conf.key_path
source: Path to google config .json file:E.g. EXT:your_extension/Resources/Private/Files/keys.json. Look this up in the documentation if you don't know what file to put here.
de: Pfad zur Google Google Konfigurationsdatei.:z.B.: EXT:your_extension/Resources/Private/Files/keys.json (Siehe Dokumentation für weitere Informationen)

# conf.indexing_api
source: Enable Google Indexing API (read documentation for how to set up)
de: Aktivieren der Google Indexing API Schnittstelle (siehe Dokumentation für weitere Informationen)

# conf.indexing_api_debug
source: Enable Google Indexing API debug messages
de: Aktivieren der Debug Benachrichtigungen: Eignet sich gut um zu testen ob alles richtig eingerichtet ist.

# be.filter.unsolicited
source: Unsolicited applications
de: Initativbewerbungen

# be.filter.unsolicited.single
source: Unsolicited application
de: Initativbewerbung

# be.widget.postings_active.title
source: Open positions
de: Offene Stellen

# be.widget.postings_active.subtitle
source: Currently active postings
de: Momentan aktive Ausschreibungen

# be.widget.postings_active.description
source: Number of currently active job postings.
de: Anzahl der momentan aktiven Stellenausschreibungen

# be.widget.applications_per_posting.title
source: Number of applications per posting
de: Anzahl der Berwerbungen pro Ausschreibung

# be.widget.applications_per_posting.description
source: Bar chart regarding number of job applications in relation to every job posting.
de: Säulendiagramm, welches die Anzahl der Bewerbungen in Relation zu allen Ausschreibungen darstellt.

# be.widget.applications_per_posting.button
source: See applications
de: Bewerbungen anzeigen

# be.widget.applications_per_posting.label
source: Number of applications
de: Anzahl der Bewerbungen
